app/Http/Controllers/Frontend/FrontendController.php

select * from `posts` order by `id` desc limit 10 offset 0
---
    public function index(){

        $data = [];
        $data['postes'] = Post::orderBy('id','desc')->paginate(10);