app/Http/Controllers/Frontend/FrontendController.php

select * from `categories` where `categories`.`id` in (2, 3, 4, 5, 6, 10)
select * from `users` where `users`.`id` in (1, 2)
select count(*) as aggregate from `posts`
---
    public function index(){

        $data = [];
        $data['postes'] = Post::with('category','user')->orderBy('id','desc')->paginate(7);

select * from `categories` where `categories`.`id` in (7)
select * from `posts` where `slug` = 'millwright' limit 1
select * from `users` where `users`.`id` in (1)
update `posts` set `views` = 3, `posts`.`updated_at` = '2019-05-30 17:35:42' where `id` = 1
---
    public function post_details($slug){

        $data = [];
        $data['single_post'] = Post::with('category','user')->where('slug',$slug)->first();
        $data['single_post']->views = $data['single_post']->views + 1;
        $data['single_post']->save();

select * from `categories` where `slug` = 'violet' limit 1
select * from `categories` where `categories`.`id` in (10)
select * from `posts` where `category_id` = 10 limit 5 offset 0
select * from `users` where `users`.`id` in (1, 2)
select count(*) as aggregate from `posts` where `category_id` = 10
---
    public function category_product($slug){

        $data = [];
        $data['category'] = Category::where('slug',$slug)->first();
        $data['postes'] = Post::with('category','user')->where('category_id',$data['category']['id'])->paginate(5);